MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334JAUI/mcu.h
/**
 *******************************************************************************
 * @file  HC32F334JAUI.h
 * @brief Headerfile for HC32F334JAUI series MCU
 @verbatim
   Change Logs:
   Date             Author          Notes
   2024-01-15       CDT             First version
   2024-06-30       CDT             Update base upon RM Rev1.00
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2024, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 **/

#ifndef __HC32F334JAUI_H__
#define __HC32F334JAUI_H__

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 * Configuration of the Cortex-M4 Processor and Core Peripherals
 ******************************************************************************/
#define __MPU_PRESENT             1       /*!< HC32F334JAUI provides MPU                                */
#define __VTOR_PRESENT            1       /*!< HC32F334JAUI supported vector table registers            */
#define __NVIC_PRIO_BITS          4       /*!< HC32F334JAUI uses 4 Bits for the Priority Levels         */
#define __Vendor_SysTickConfig    0       /*!< Set to 1 if different SysTick Config is used         */
#define __FPU_PRESENT             1       /*!< FPU present                                          */

/*******************************************************************************
 * Interrupt Number Definition
 ******************************************************************************/
typedef enum {
    NMI_IRQn                    = -14, /*  2 Non Maskable                     */
    HardFault_IRQn              = -13, /*  3 Hard Fault                       */
    MemManageFault_IRQn         = -12, /*  4 MemManage Fault                  */
    BusFault_IRQn               = -11, /*  5 Bus Fault                        */
    UsageFault_IRQn             = -10, /*  6 Usage Fault                      */
    SVC_IRQn                    = -5,  /* 11 SVCall                           */
    DebugMonitor_IRQn           = -4,  /* 12 DebugMonitor                     */
    PendSV_IRQn                 = -2,  /* 14 Pend SV                          */
    SysTick_IRQn                = -1,  /* 15 System Tick                      */
    INT000_IRQn                 = 0,
    INT001_IRQn                 = 1,
    INT002_IRQn                 = 2,
    INT003_IRQn                 = 3,
    INT004_IRQn                 = 4,
    INT005_IRQn                 = 5,
    INT006_IRQn                 = 6,
    INT007_IRQn                 = 7,
    INT008_IRQn                 = 8,
    INT009_IRQn                 = 9,
    INT010_IRQn                 = 10,
    INT011_IRQn                 = 11,
    INT012_IRQn                 = 12,
    INT013_IRQn                 = 13,
    INT014_IRQn                 = 14,
    INT015_IRQn                 = 15,
    EXTINT_PORT_EIRQ0_IRQn      = 16,
    EXTINT_PORT_EIRQ1_IRQn      = 17,
    EXTINT_PORT_EIRQ2_IRQn      = 18,
    EXTINT_PORT_EIRQ3_IRQn      = 19,
    EXTINT_PORT_EIRQ4_IRQn      = 20,
    EXTINT_PORT_EIRQ5_IRQn      = 21,
    EXTINT_PORT_EIRQ6_IRQn      = 22,
    EXTINT_PORT_EIRQ7_IRQn      = 23,
    EXTINT_PORT_EIRQ8_IRQn      = 24,
    EXTINT_PORT_EIRQ9_IRQn      = 25,
    EXTINT_PORT_EIRQ10_IRQn     = 26,
    EXTINT_PORT_EIRQ11_IRQn     = 27,
    EXTINT_PORT_EIRQ12_IRQn     = 28,
    EXTINT_PORT_EIRQ13_IRQn     = 29,
    EXTINT_PORT_EIRQ14_IRQn     = 30,
    EXTINT_PORT_EIRQ15_IRQn     = 31,
    SWINT0_IRQn                 = 0,
    SWINT1_IRQn                 = 1,
    SWINT2_IRQn                 = 2,
    SWINT3_IRQn                 = 3,
    SWINT4_IRQn                 = 4,
    SWINT5_IRQn                 = 5,
    SWINT6_IRQn                 = 6,
    SWINT7_IRQn                 = 7,
    SWINT8_IRQn                 = 8,
    SWINT9_IRQn                 = 9,
    SWINT10_IRQn                = 10,
    SWINT11_IRQn                = 11,
    SWINT12_IRQn                = 12,
    SWINT13_IRQn                = 13,
    SWINT14_IRQn                = 14,
    SWINT15_IRQn                = 15,
    SWINT16_IRQn                = 16,
    SWINT17_IRQn                = 17,
    SWINT18_IRQn                = 18,
    SWINT19_IRQn                = 19,
    SWINT20_IRQn                = 20,
    SWINT21_IRQn                = 21,
    SWINT22_IRQn                = 22,
    SWINT23_IRQn                = 23,
    SWINT24_IRQn                = 24,
    SWINT25_IRQn                = 25,
    SWINT26_IRQn                = 26,
    SWINT27_IRQn                = 27,
    SWINT28_IRQn                = 28,
    SWINT29_IRQn                = 29,
    SWINT30_IRQn                = 30,
    SWINT31_IRQn                = 31,
    DMA_ERR_IRQn                = 32,
    DMA_TC0_BTC0_IRQn           = 33,
    DMA_TC1_BTC1_IRQn           = 34,
    DMA_TC2_BTC2_IRQn           = 35,
    DMA_TC3_BTC3_IRQn           = 36,
    DMA_TC4_BTC4_IRQn           = 37,
    DMA_TC5_BTC5_IRQn           = 38,
    DMA_TC6_BTC6_IRQn           = 39,
    DMA_TC7_BTC7_IRQn           = 40,
    EFM_PEERR_RDCOL_IRQn        = 41,
    EFM_OPTEND_IRQn             = 42,
    FPU_ERR_IRQn                = 43,
    TMR0_1_IRQn                 = 44,
    TMR0_2_IRQn                 = 45,
    RTC_IRQn                    = 46,
    XTAL_IRQn                   = 47,
    WKTM_IRQn                   = 48,
    SWDT_IRQn                   = 49,
    TMR6_1_GCMP_IRQn            = 50,
    TMR6_1_OVF_UDF_IRQn         = 51,
    TMR6_1_DTE_IRQn             = 52,
    TMR6_1_SCMP_IRQn            = 53,
    TMRA_1_OVF_UDF_IRQn         = 54,
    TMRA_1_CMP_IRQn             = 55,
    TMR6_2_GCMP_IRQn            = 56,
    TMR6_2_OVF_UDF_IRQn         = 57,
    TMR6_2_DTE_IRQn             = 58,
    TMR6_2_SCMP_IRQn            = 59,
    TMRA_2_OVF_UDF_IRQn         = 60,
    TMRA_2_CMP_IRQn             = 61,
    TMR6_3_GCMP_IRQn            = 62,
    TMR6_3_OVF_UDF_IRQn         = 63,
    TMR6_3_DTE_IRQn             = 64,
    TMR6_3_SCMP_IRQn            = 65,
    TMRA_3_OVF_UDF_IRQn         = 66,
    TMRA_3_CMP_IRQn             = 67,
    TMR6_4_GCMP_IRQn            = 68,
    TMR6_4_OVF_UDF_IRQn         = 69,
    TMR6_4_DTE_IRQn             = 70,
    TMR6_4_SCMP_IRQn            = 71,
    TMRA_4_OVF_UDF_IRQn         = 72,
    TMRA_4_CMP_IRQn             = 73,
    HRPWM_1_GCMP_IRQn           = 74,
    HRPWM_1_OVF_UDF_IRQn        = 75,
    HRPWM_1_SCMP_IRQn           = 76,
    HRPWM_1_GCAP_IRQn           = 77,
    HRPWM_2_GCMP_IRQn           = 78,
    HRPWM_2_OVF_UDF_IRQn        = 79,
    HRPWM_2_SCMP_IRQn           = 80,
    HRPWM_2_GCAP_IRQn           = 81,
    HRPWM_IRQn                  = 82,
    EMB_GR0_IRQn                = 83,
    EMB_GR1_IRQn                = 84,
    EMB_GR2_IRQn                = 85,
    EMB_GR3_IRQn                = 86,
    HRPWM_3_GCMP_IRQn           = 87,
    HRPWM_3_OVF_UDF_IRQn        = 88,
    HRPWM_3_SCMP_IRQn           = 89,
    HRPWM_3_GCAP_IRQn           = 90,
    HRPWM_4_GCMP_IRQn           = 91,
    HRPWM_4_OVF_UDF_IRQn        = 92,
    HRPWM_4_SCMP_IRQn           = 93,
    HRPWM_4_GCAP_IRQn           = 94,
    EMB_GR4_IRQn                = 95,
    EMB_GR5_IRQn                = 96,
    EMB_GR6_IRQn                = 97,
    EMB_GR7_IRQn                = 98,
    EMB_GR8_IRQn                = 99,
    HRPWM_5_GCMP_IRQn           = 100,
    HRPWM_5_OVF_UDF_IRQn        = 101,
    HRPWM_5_SCMP_IRQn           = 102,
    HRPWM_5_GCAP_IRQn           = 103,
    HRPWM_6_GCMP_IRQn           = 104,
    HRPWM_6_OVF_UDF_IRQn        = 105,
    HRPWM_6_SCMP_IRQn           = 106,
    HRPWM_6_GCAP_IRQn           = 107,
    MCANRAM_ECCER_IRQn          = 108,
    MCAN1_INT0_IRQn             = 109,
    MCAN1_INT1_IRQn             = 110,
    MCAN2_INT0_IRQn             = 111,
    MCAN2_INT1_IRQn             = 112,
    TMR4_GCMP_IRQn              = 113,
    TMR4_OVF_UDF_IRQn           = 114,
    TMR4_RELOAD_IRQn            = 115,
    TMR4_SCMP_IRQn              = 116,
    CMP1_IRQ_IRQn               = 117,
    CMP2_IRQ_IRQn               = 118,
    CMP3_IRQ_IRQn               = 119,
    I2C_IRQn                    = 120,
    USART1_IRQn                 = 121,
    USART1_TCI_IRQn             = 122,
    SPI_IRQn                    = 123,
    TMRA_5_OVF_UDF_IRQn         = 124,
    TMRA_5_CMP_IRQn             = 125,
    EVENT_PORT1_IRQn            = 126,
    EVENT_PORT2_IRQn            = 127,
    EVENT_PORT3_IRQn            = 128,
    EVENT_PORT4_IRQn            = 129,
    USART2_IRQn                 = 130,
    USART2_TCI_IRQn             = 131,
    USART3_IRQn                 = 132,
    USART3_TCI_IRQn             = 133,
    USART4_IRQn                 = 134,
    USART4_TCI_IRQn             = 135,
    PLA_IRQn                    = 136,
    USART1_WUPI_IRQn            = 137,
    LVD1_IRQn                   = 138,
    LVD2_IRQn                   = 139,
    FCM_IRQn                    = 140,
    WDT_IRQn                    = 141,
    CTC_IRQn                    = 142,
    ADC1_IRQn                   = 143,
    ADC2_IRQn                   = 144,
    ADC3_IRQn                   = 145,
} IRQn_Type;

#include <core_cm4.h>
#include <stdint.h>

