MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334JAUI/mcu.h
/*  Bit definition for HRPWM_HSTAR1 register  */
#define HRPWM_HSTAR1_STAS_POS                          (7U)
#define HRPWM_HSTAR1_STAS                              (0x00000080UL)
#define HRPWM_HSTAR1_HSTA8_POS                         (8U)
#define HRPWM_HSTAR1_HSTA8                             (0x00000100UL)
#define HRPWM_HSTAR1_HSTA9_POS                         (9U)
#define HRPWM_HSTAR1_HSTA9                             (0x00000200UL)
#define HRPWM_HSTAR1_HSTA10_POS                        (10U)
#define HRPWM_HSTAR1_HSTA10                            (0x00000400UL)
#define HRPWM_HSTAR1_HSTA11_POS                        (11U)
#define HRPWM_HSTAR1_HSTA11                            (0x00000800UL)
#define HRPWM_HSTAR1_HSTA16_POS                        (16U)
#define HRPWM_HSTAR1_HSTA16                            (0x00010000UL)
#define HRPWM_HSTAR1_HSTA17_POS                        (17U)
#define HRPWM_HSTAR1_HSTA17                            (0x00020000UL)
#define HRPWM_HSTAR1_HSTA18_POS                        (18U)
#define HRPWM_HSTAR1_HSTA18                            (0x00040000UL)
#define HRPWM_HSTAR1_HSTA19_POS                        (19U)
#define HRPWM_HSTAR1_HSTA19                            (0x00080000UL)
#define HRPWM_HSTAR1_HSTA20_POS                        (20U)
#define HRPWM_HSTAR1_HSTA20                            (0x00100000UL)
#define HRPWM_HSTAR1_HSTA21_POS                        (21U)
#define HRPWM_HSTAR1_HSTA21                            (0x00200000UL)
#define HRPWM_HSTAR1_HSTA22_POS                        (22U)
#define HRPWM_HSTAR1_HSTA22                            (0x00400000UL)
#define HRPWM_HSTAR1_HSTA23_POS                        (23U)
#define HRPWM_HSTAR1_HSTA23                            (0x00800000UL)

/*  Bit definition for HRPWM_HCLRR1 register  */
#define HRPWM_HCLRR1_CLES_POS                          (7U)
#define HRPWM_HCLRR1_CLES                              (0x00000080UL)
#define HRPWM_HCLRR1_HCLE8_POS                         (8U)
#define HRPWM_HCLRR1_HCLE8                             (0x00000100UL)
#define HRPWM_HCLRR1_HCLE9_POS                         (9U)
#define HRPWM_HCLRR1_HCLE9                             (0x00000200UL)
#define HRPWM_HCLRR1_HCLE10_POS                        (10U)
#define HRPWM_HCLRR1_HCLE10                            (0x00000400UL)
#define HRPWM_HCLRR1_HCLE11_POS                        (11U)
#define HRPWM_HCLRR1_HCLE11                            (0x00000800UL)
#define HRPWM_HCLRR1_HCLE16_POS                        (16U)
#define HRPWM_HCLRR1_HCLE16                            (0x00010000UL)
#define HRPWM_HCLRR1_HCLE17_POS                        (17U)
#define HRPWM_HCLRR1_HCLE17                            (0x00020000UL)
#define HRPWM_HCLRR1_HCLE18_POS                        (18U)
#define HRPWM_HCLRR1_HCLE18                            (0x00040000UL)
#define HRPWM_HCLRR1_HCLE19_POS                        (19U)
#define HRPWM_HCLRR1_HCLE19                            (0x00080000UL)
#define HRPWM_HCLRR1_HCLE20_POS                        (20U)
#define HRPWM_HCLRR1_HCLE20                            (0x00100000UL)
#define HRPWM_HCLRR1_HCLE21_POS                        (21U)
#define HRPWM_HCLRR1_HCLE21                            (0x00200000UL)
#define HRPWM_HCLRR1_HCLE22_POS                        (22U)
#define HRPWM_HCLRR1_HCLE22                            (0x00400000UL)
#define HRPWM_HCLRR1_HCLE23_POS                        (23U)
#define HRPWM_HCLRR1_HCLE23                            (0x00800000UL)

/*  Bit definition for HRPWM_HCPAR1 register  */
#define HRPWM_HCPAR1_HCPA8_POS                         (8U)
#define HRPWM_HCPAR1_HCPA8                             (0x00000100UL)
#define HRPWM_HCPAR1_HCPA9_POS                         (9U)
#define HRPWM_HCPAR1_HCPA9                             (0x00000200UL)
#define HRPWM_HCPAR1_HCPA10_POS                        (10U)
#define HRPWM_HCPAR1_HCPA10                            (0x00000400UL)
#define HRPWM_HCPAR1_HCPA11_POS                        (11U)
#define HRPWM_HCPAR1_HCPA11                            (0x00000800UL)
#define HRPWM_HCPAR1_HCPA16_POS                        (16U)
#define HRPWM_HCPAR1_HCPA16                            (0x00010000UL)
#define HRPWM_HCPAR1_HCPA17_POS                        (17U)
#define HRPWM_HCPAR1_HCPA17                            (0x00020000UL)
#define HRPWM_HCPAR1_HCPA18_POS                        (18U)
#define HRPWM_HCPAR1_HCPA18                            (0x00040000UL)
#define HRPWM_HCPAR1_HCPA19_POS                        (19U)
#define HRPWM_HCPAR1_HCPA19                            (0x00080000UL)
#define HRPWM_HCPAR1_HCPA20_POS                        (20U)
#define HRPWM_HCPAR1_HCPA20                            (0x00100000UL)
#define HRPWM_HCPAR1_HCPA21_POS                        (21U)
#define HRPWM_HCPAR1_HCPA21                            (0x00200000UL)
#define HRPWM_HCPAR1_HCPA22_POS                        (22U)
#define HRPWM_HCPAR1_HCPA22                            (0x00400000UL)
#define HRPWM_HCPAR1_HCPA23_POS                        (23U)
#define HRPWM_HCPAR1_HCPA23                            (0x00800000UL)

/*  Bit definition for HRPWM_HCPBR1 register  */
#define HRPWM_HCPBR1_HCPB8_POS                         (8U)
#define HRPWM_HCPBR1_HCPB8                             (0x00000100UL)
#define HRPWM_HCPBR1_HCPB9_POS                         (9U)
#define HRPWM_HCPBR1_HCPB9                             (0x00000200UL)
#define HRPWM_HCPBR1_HCPB10_POS                        (10U)
#define HRPWM_HCPBR1_HCPB10                            (0x00000400UL)
#define HRPWM_HCPBR1_HCPB11_POS                        (11U)
#define HRPWM_HCPBR1_HCPB11                            (0x00000800UL)
#define HRPWM_HCPBR1_HCPB16_POS                        (16U)
#define HRPWM_HCPBR1_HCPB16                            (0x00010000UL)
#define HRPWM_HCPBR1_HCPB17_POS                        (17U)
#define HRPWM_HCPBR1_HCPB17                            (0x00020000UL)
#define HRPWM_HCPBR1_HCPB18_POS                        (18U)
#define HRPWM_HCPBR1_HCPB18                            (0x00040000UL)
#define HRPWM_HCPBR1_HCPB19_POS                        (19U)
#define HRPWM_HCPBR1_HCPB19                            (0x00080000UL)
#define HRPWM_HCPBR1_HCPB20_POS                        (20U)
#define HRPWM_HCPBR1_HCPB20                            (0x00100000UL)
#define HRPWM_HCPBR1_HCPB21_POS                        (21U)
#define HRPWM_HCPBR1_HCPB21                            (0x00200000UL)
#define HRPWM_HCPBR1_HCPB22_POS                        (22U)
#define HRPWM_HCPBR1_HCPB22                            (0x00400000UL)
#define HRPWM_HCPBR1_HCPB23_POS                        (23U)
#define HRPWM_HCPBR1_HCPB23                            (0x00800000UL)

